{
  "version": "https://jsonfeed.org/version/1",
  "title": "markentier.tech",
  "home_page_url": "https://markentier.tech",
  "feed_url": "https://markentier.tech/feed.json",
  "icon": "https://markentier.tech/m-128.png",
  "favicon": "https://markentier.tech/favicon.ico",
  "author": { "name": "Christoph Grabo" },
  "items": [
    {
      "id": "https://markentier.tech/posts/2018/03/how-to-build-static-site-blog/",
      "url": "https://markentier.tech/posts/2018/03/how-to-build-static-site-blog/",
      "date_published": "2018-03-15T00:23:42Z",
      "banner_image": "https://markentier.tech/posts/2018/03/how-to-build-static-site-blog/cover.png",
      "summary": "A comment on my previous post »Push, rinse, repeat …« made me think about that you might want to know how this blog is being built and deployed.",
      "tags": ["static site","generator","netlify","cobalt.rs","ssl/tls","github","lets encrypt","blog"],
      "content_html": "<p>A comment on my previous post <a href=\"/posts/2018/03/push-rinse-repeat/\">»Push, rinse, repeat …«</a> made me think about that you might want to know how this blog is being built and deployed.</p>\n<!-- more -->\n<p>This site (if you reading this blog post at its canonical location) is freshly hatched. And I realized that I used a couple of things some people might not be familiar with … yet.</p>\n<p>While everything is still in progress, the heavy lifting for getting it up and running is already done, and I think I can maybe give you some insights on how it is made.</p>\n<p>In this article we will discover how to get a static site or blog bootstrapped with a GitHub repository, filling it with cobalt.rs, deploying on netlify, using your own domain, get it DNS managed, and using SSL/TLS via Let's Encrypt (https!). A final note on status monitoring via updown.io included as well.</p>\n<p>Sounds exciting? Then keep reading. Beware the long read, it is probably not your typical how-to guide, it is more like a journey.</p>\n<h3 id=\"darkness-was-over-the-surface-of-the-deep\">Darkness was over the surface of the deep</h3>\n<p>Step Zero would be to have a reason why you want to build a site or blog, but I assume you found your reason already and just cannot wait to get your ideas published into the world.</p>\n<p>So especially tech-savvy people love to build or run their own stuff. The middle of a hosted blog and running stuff on your own server is probably using some managed services without relying on the software of the hosting providers. Tools like WordPress are cool and I remember that they are quite beginner friendly, also to the lesser tech-savvy ones, but—no matter your actual background and knowledge—you might have come to the conclusion that you really want to explore the field of owning more of the build and run aspect. You might not need a fully fledged software, maybe even require less to no dynamic features (makes it mostly safer against hacks), or you're just not satisfied with what they offer. But writing your own CMS or blog engine from scratch is also something many developers have tried, but in the end stepped away or replaced this idea with better projects. I always wanted to build such software, but lost interest or motivation in continuing it. A static site usually serves my purposes quite well.</p>\n<h3 id=\"all-your-rebase-are-belong-to-us\">All your rebase are belong to us</h3>\n<p>Anyway I'm lost in my own thoughts, but you want to read a guide, not my history and reasoning. At least I could save this for a future post.</p>\n<p>So, the very first thing is: <strong>how and where do I want to store my data (content and site stuff) and which tool do I want to use to build and manage?</strong></p>\n<p>Nowadays a GitHub repository seems to be the most favourite choice. You could use alternative services and even another version control system entirely. Git is quite popular and you will find a lot of help out there when stuck.</p>\n<p><img src=\"./how-to_new-github-repo.png\" alt=\"How to create a new repository on GitHub\" /></p>\n<p>Since we want to build a static site, we need a tool helping us. Of course, you could write and maintain everything manually, but you will get exhausted by it.</p>\n<h3 id=\"generators-generators-generators\">Generators, Generators, Generators!</h3>\n<p>So naturally a vast amount of static site generators exists, because a lot of people feel the same. And plenty of them created applications to help us.</p>\n<p>I went for <a href=\"https://cobalt-org.github.io/\">cobalt</a>, because I want to learn and use Rust more often. If you not so much into such adventures, then the following tools will do it as well: <em>Jekyll, Hugo, OctoPress, Gatsby, Middleman, …</em> (check out <a href=\"https://www.staticgen.com/\">https://www.staticgen.com/</a> to get a more complete list of available static site generators). Jekyll is special, because it is also supported by <a href=\"https://pages.github.com/\">GitHub Pages</a>, which would be another alternative to deploy your static site.</p>\n<p><img src=\"./how-to_cobalt-org.png\" alt=\"Homepage of cobalt.rs, a static site generator written in Rust\" /></p>\n<p>Within your freshly cloned and probably still very empty repository you run something like <code>cobalt init</code> (or whatever your tool requires) and start the heavy work of creating a website from bits and pieces. You can spend already hours and days just building the site, since layout and design are a neverending story.\nBut also pages and posts need to be written, and this will take some time as well.</p>\n<h3 id=\"lt-head-gt-lt-body-gt\"><code>&lt;/head&gt;&lt;body&gt;</code></h3>\n<p>Of course, you can start easy. It doesn't have to be pixel perfect right from the start. Look at this one, it might seem a bit rough and edgy here and there (depending when you will discover this article).</p>\n<p>Anyway, let's assume you learned some lessons around web design and writing. So don't forget to commit and push your changes to your GitHub repository. Do it more often than not. Your computer might store everything now, but it's not reliable in the long run and you don't want to deploy your machine anyway. Building a home server is a completely different story.</p>\n<p>So, you built, wrote, pushed. Now we come to the beauty of 2018: let it automatically publish your site and expose it to the world!</p>\n<h3 id=\"publish-it-like-it-s-hot\">Publish it like it's hot</h3>\n<p>I discovered <a href=\"https://www.netlify.com/\">netlify</a> just because we use and support it at my work (<a href=\"https://www.contentful.com/\">Contentful</a>), and by googling for this article I just found some resources if you're interested in it:</p>\n<ul>\n<li><a href=\"https://www.gatsbyjs.org/blog/2017-12-06-gatsby-plus-contentful-plus-netlify/\">https://www.gatsbyjs.org/blog/2017-12-06-gatsby-plus-contentful-plus-netlify/</a></li>\n<li><a href=\"https://dev.to/milkstarz/contentful-and-netlify-the-dynamic-duo-of-static-site-management-55i\">https://dev.to/milkstarz/contentful-and-netlify-the-dynamic-duo-of-static-site-management-55i</a></li>\n<li><a href=\"https://www.smcculloch.com/code/netlify-contentful-jamstack\">https://www.smcculloch.com/code/netlify-contentful-jamstack</a></li>\n<li><a href=\"https://www.netlify.com/blog/2017/07/06/contentful-an-api-first-cms/\">https://www.netlify.com/blog/2017/07/06/contentful-an-api-first-cms/</a></li>\n</ul>\n<p>Since I'm not starting with a Contentful-backed approach I will not dive deeper into it. I leave the advertising to our evangelists for now. :-)</p>\n<p>Initially I really thought that GitHub Pages would be okay already, but netlify comes with some batteries I didn't want to miss, the biggest one was the <a href=\"https://letsencrypt.org/\">Let's Encrypt</a> based SSL/TLS certificate, so I can get <code>https</code> all the time and not have to think about the renewal in the future. This works best if you not only bring your own domain, but also can configure it this way that you can let netlify manage your DNS settings (I think this was recommended for better subdomain stuff and enforcing https across them; could be done in your DNS provider probably, but hey, let's give it a try and see how netlify can deal with it).</p>\n<p><img src=\"./how-to_netlify-dns.png\" alt=\"Manage DNS for your domain with netlify\" /></p>\n<p>Another cool feature is that you can use GitHub's pull requests (and branching in general) to get a preview deployment. So you can check your changes not only on your local machine, but also let other see how the things will look like (pretty good for teams and collaboration). In fact, I used this for this blog post, so I can test this opportunity. Another tiny benefit is that you can use online validators (like <a href=\"https://validator.w3.org/nu/\">https://validator.w3.org/nu/</a> for HTML) and fix issues before they go into your production site. Sounds cool, he?</p>\n<p><em>Hey, netlify folks, when you reading this by accident, you can donate a bit to <a href=\"https://www.paypal.me/asaaki\">my PayPal account</a> for my advertisement efforts.</em></p>\n<p>Setting up netlify is quite easy even without the domain stuff. Point it to your repository and maybe define what (supported) tool should be run.\nSince <code>cobalt</code> is not widely used yet, I already ship my generated site with the repo, so I only need to tell netlify, which folder to use instead. That would be also the case if you went full manual and craft your pages by hand.</p>\n<p>Netlify offers a lot more stuff, which I'm not using yet. You should discover their features on your own. Split testing might be interesting for sites with customers and your attempts to drag them to CTAs (call to actions). Form handling is probably nice if you want to get feedback or collect other data.</p>\n<h3 id=\"hey-author-where-you-re-going\">Hey, author, where you're going?</h3>\n<p>Sorry. You wanted to know how difficult it is to get your site deployed with netlify.</p>\n<p>Well, I have to disappoint you. Once you've set up your repo, branch and optional configs, you're pretty much done.\nYou can either trigger a deployment manually or just push changes to your previously configured branch.\nYou wait a few seconds (the very first deployment might take a slightly bit longer) and then you check if you're site is up and running.</p>\n<p>I really mean it, it is so simple, that any How To for netlify is more complicated and longer than their step by step guidance within their interface. Give it a try.</p>\n<p>If you're really stuck, then their help pages should do the rest.\nAll the things I wanted to use and try was provided within netlify's documentation. And in the end, deploying a static site should not be so much magic.</p>\n<h3 id=\"vertrauen-ist-gut-kontrolle-ist-besser\">Vertrauen ist gut, Kontrolle ist besser</h3>\n<p>I know that nothing comes with perfect 100 percent uptime. That's usually okay. And better you're notified about it. Independently, of course.\nWhile you can go with well-known services like pingdom, I use <a href=\"https://updown.io/\">updown.io</a>, which is not free, but with initial signup you will get enough credits to monitor a single website for a long time. If you think it is really not worth it, change to another uptime monitoring solution.</p>\n<p>What I like about updown is, that they offer a simple status page, you can expose via a subdomain you control. For this blog you can check it under <a href=\"https://status.markentier.tech/\">https://status.markentier.tech/</a>:</p>\n<p><img src=\"./how-to_updown-monitoring.png\" alt=\"updown.io uptime monitoring page for markentier.tech\" /></p>\n<p>That's all I have for today.</p>\n<p>I hope this article is useful to anyone of you. If you want to give feedback, have questions or suggestions, you can usually find me on Twitter: <a href=\"https://twitter.com/asaaki\">https://twitter.com/asaaki</a> — See you soon! 👋🏽</p>"
    },
    {
      "id": "https://markentier.tech/posts/2018/03/push-rinse-repeat/",
      "url": "https://markentier.tech/posts/2018/03/push-rinse-repeat/",
      "date_published": "2018-03-11T18:00:00Z",
      "banner_image": "https://markentier.tech/posts/2018/03/push-rinse-repeat/cover.png",
      "summary": "I haven't bootstrapped a blog or static site for quite some time.",
      "tags": ["new","blog","bootstrap","fresh","static site"],
      "content_html": "<p>I haven't bootstrapped a blog or static site for quite some time.</p>\n<!-- more -->\n<p>With a service like netlify this becomes kind of a bearable task.</p>\n<p>And since this site hasn't seen much popularity yet—it just exists for less than 24 hours—I can even play this game live and in production.\nLike the good old PHP-FTP times.</p>\n<p>For fun I added already some meta tags for social media consumption like Twitter.</p>\n<p>It should look like the article image.</p>\n<p>This is just the second pretty useless post, but I think this is not so unusal for new blogs.\nBear with me, actual content will follow. Hence this new site. ;-)</p>\n<hr />\n<p><em>Crossposted to: <a href=\"https://dev.to/asaaki/push-rinse-repeat---16jo\">dev.to</a>, <a href=\"https://medium.com/markentier-tech/push-rinse-repeat-1e277fa35942\">Medium</a></em></p>"
    },
    {
      "id": "https://markentier.tech/posts/2018/03/hello-code/",
      "url": "https://markentier.tech/posts/2018/03/hello-code/",
      "date_published": "2018-03-10T23:42:00Z",
      "summary": "Nothing but initialization of yet another tech blog.",
      "tags": ["hello","world","new","blog"],
      "content_html": "<p>Nothing but initialization of yet another tech blog.</p>\n<!-- more -->\n<p>This blog post has no deeper meaning.\nIt exists for sole entertainment of systems, servers, build tools, and the author of this site.</p>\n<pre style=\"background-color:#272822\">\n<span style=\"background-color:#272822;color:#f92672;\">class </span><span style=\"background-color:#272822;text-decoration:underline;color:#a6e22e;\">MarkentierTech </span><span style=\"background-color:#272822;color:#f8f8f2;\">&lt; </span><span style=\"background-color:#272822;text-decoration:underline;font-style:italic;color:#a6e22e;\">Blog\n</span><span style=\"background-color:#272822;color:#f8f8f2;\">  </span><span style=\"background-color:#272822;color:#f92672;\">def </span><span style=\"background-color:#272822;color:#a6e22e;\">render\n</span><span style=\"background-color:#272822;color:#f8f8f2;\">    </span><span style=\"background-color:#272822;color:#75715e;\"># magic here\n</span><span style=\"background-color:#272822;color:#f8f8f2;\">    </span><span style=\"background-color:#272822;color:#ae81ff;\">:unicorns!\n</span><span style=\"background-color:#272822;color:#f8f8f2;\">  </span><span style=\"background-color:#272822;color:#f92672;\">end\n</span><span style=\"background-color:#272822;color:#f92672;\">end\n</span><span style=\"background-color:#272822;color:#f8f8f2;\">\n</span><span style=\"background-color:#272822;color:#75715e;\">#=&gt; 567890-abcdefghi-234567890-abcdefghi-234567890-abcdefghi-234567890-abcdef.80\n</span></pre>"
    }
  ]
}
